<?php
$regex = [
	'firstname' => [
        'pattern' => '/^[a-zA-ZА-Яа-яёЁ]+$/u'
    ],
    'secondname' => [
        'pattern' => '/^[a-zA-ZА-Яа-яёЁ]+$/u'
    ],
    'position' => [
        'pattern' => ''
    ],
    'phone' => [
        'pattern' => '/^(\+?38)?0?\s?[5-9][0-9]\s?[0-9]{3}\s?[0-9]{4}$/' // учитываются пробелы, +380/380/0/_ 
    ],
    'iban' => [
        'pattern' => '/^[A-Z]{2}[0-9]{2}[a-zA-Z0-9]{11,30}$/' // без учитывания пробелов при вводе, но с учетом всех стран 
    ]                                                         // планируется добавить проверку по контрольной сумме iban
];